Project URL follow-up: https://www.youtube.com/watch?v=JrIG6Qtb4eg&list=PL_1pt6K-CLoDMEbYy2PcZuITWEjqMfyoA&ab_channel=DataThinkers

In [103]:
import pandas as pd

In [104]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [105]:
#Display 3 rows of the dataframe
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [106]:
##Check last 3 rows of the dataframe
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [107]:
#Find shape of the dataframe (Number of rows and columns)
df1.shape
print("Number of rows:", df1.shape[0])
print("Number of columns:", df1.shape[1])

Number of rows: 7
Number of columns: 3

In [108]:
#Get information about the dataframe like total number of rows, columns, data types of each column and memory requirements
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [109]:
#cHECK the null values in the dataframe
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [110]:
#get overall statistics of the dataframe
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [111]:
#get the descriptive statistics of the dataframe
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [112]:
#find unique values from the gender column
df1 ['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [88]:
#find the number of unique values from the gender column
df1 ['Gender'].nunique()

2

In [89]:
#display count of unique values from gender column
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [90]:
#find the total number of students having marks greater between 90 and 100 (inclusive) using between method
df1[df1['Marks'] >= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [91]:
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [92]:
#between method
df1[df1['Marks'].between(90, 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [93]:
#find average marks of all the students
df1['Marks'].mean()

np.float64(92.14285714285714)

In [94]:
#find min marks of all the students
df1['Marks'].min()

np.int64(83)

In [95]:
#ind max marks of all the students
df1['Marks'].max()

np.int64(99)

In [96]:
#apply method
def marks(x):
    return x/2

In [97]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [98]:
#tạo thêm cột mới 'Half_Marks' với giá trị là nửa số điểm
df1['Half_Marks'] = df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [99]:
df1['Name'].apply(len)  # This will raise an error since 'length' is not defined

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [100]:
#map function
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [101]:
df1['Gender'].map({'Male' : 1, 'Female' : 0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [102]:
#cũng như trên nhưng tạo cột mới có tên Male_Female => với male = 1 và female = 0
df1['Male_Female'] = df1['Gender'].map({'Male' : 1, 'Female' : 0})
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [121]:
df1['Male_Female'] = df1['Gender'].map({'Male' : 1, 'Female' : 0})
df1

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [123]:
#drop a column from the dataframe
df1.drop('Male_Female', axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [124]:
#print name of the columns in the dataframe
df1.columns

Index(['Name', 'Marks', 'Gender', 'Male_Female'], dtype='object')

In [125]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [126]:
#sort the dataframe as per the marks volumn
df1

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [128]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender  Male_Female
2   Krisha     99  Female            0
6  Archana     99  Female            0
0  Priyang     98    Male            1
4   Parshv     90    Male            1
1   Aadhya     89  Female            0
3   Vedant     87    Male            1
5   Mittal     83  Female            0

In [ ]:
#display name and marks of female students only
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

: